SDK/aax/Documentation/Doxygen/dot/aax_parameter_entities_update.dot
//        Copyright 2016, 2021, 2023-2024 Avid Technology, Inc.
//        All rights reserved.
// 
// This file is part of the Avid AAX SDK.
// 
// The AAX SDK is subject to commercial or open-source licensing.
// 
// By using the AAX SDK, you agree to the terms of both the Avid AAX SDK License
// Agreement and Avid Privacy Policy.
// 
// AAX SDK License: https://developer.avid.com/aax
// Privacy Policy: https://www.avid.com/legal/privacy-policy-statement
// 
// Or: You may also use this code under the terms of the GPL v3 (see
// www.gnu.org/licenses).
// 
// THE AAX SDK IS PROVIDED "AS IS" WITHOUT ANY WARRANTY, AND ALL WARRANTIES, WHETHER
// EXPRESSED OR IMPLIED, INCLUDING MERCHANTABILITY AND FITNESS FOR PURPOSE, ARE
// DISCLAIMED.

graph aax_parameter_entities_update {
	graph [ fontname=Helvetica ];
	node [shape=record, fontname=Helvetica, fontsize=10];
	
	// Nodes
	//
	node_host [ label="Host" shape="diamond" ];
	
	node_parameterdata [ label="Parameter Data" shape="record" style="filled" fillcolor="lightblue" ];
	
	subgraph cluster_view1 {
		label="Client 1";
		style=rounded;
		node_view1 [ label="View" shape="oval" style="filled" fillcolor="lightblue" ];
		node_viewcontroller1 [ label="View Controller" shape="oval" style="filled" ];
	}
	subgraph cluster_view2 {
		label="Client 2";
		style=rounded;
		node_view2 [ label="View" shape="oval" style="filled" fillcolor="lightblue" ];
		node_viewcontroller2 [ label="View Controller" shape="oval" style="filled" ];
	}
	subgraph cluster_view3 {
		label="Client 3";
		style=rounded;
		node_view3 [ label="View" shape="oval" style="filled" fillcolor="lightblue" ];
	}
	//
	/////////
	
	// Arrangement constraints
	rankdir=BT;
	node_viewcontroller1 -- node_parameterdata [ style="invis" ];
	node_viewcontroller2 -- node_parameterdata [ style="invis" ];
	node_view3 -- node_parameterdata [ style="invis" ];
	node_parameterdata -- node_host [style="invis" ];
//	{rank=same; node_host node_parameterdata}


	// TOUCH HANDLED
	node_host [ label="Host\r(Client 1 has touch)" shape="diamond" ];
	
	// UPDATE
	node_viewcontroller1 [ fillcolor="salmon" ];
	node_parameterdata [ fillcolor="salmon" ];
	node_viewcontroller1 -- node_host [ label="set" URL="\ref AAX_IAutomationDelegate::PostSetValueRequest()" arrowhead="normal" dir="forward" constraint=false ];
	node_host -- node_parameterdata [ label="update value\r(async)" URL="\ref AAX_IEffectParameters::UpdateParameterNormalizedValue()" arrowhead="normal" dir="forward" constraint=	false ];
}
