SDK/aax/Documentation/Doxygen/msc/AAX_ParameterUpdate_Initialization.msc
/*===================================================================================================

Copyright 2016, 2023-2024 Avid Technology, Inc. 
All rights reserved.

This file is part of the Avid AAX SDK.

The AAX SDK is subject to commercial or open-source licensing.

By using the AAX SDK, you agree to the terms of both the Avid AAX SDK License
Agreement and Avid Privacy Policy.

AAX SDK License: https://developer.avid.com/aax
Privacy Policy: https://www.avid.com/legal/privacy-policy-statement

Or: You may also use this code under the terms of the GPL v3 (see
www.gnu.org/licenses).

THE AAX SDK IS PROVIDED "AS IS" WITHOUT ANY WARRANTY, AND ALL WARRANTIES, WHETHER
EXPRESSED OR IMPLIED, INCLUDING MERCHANTABILITY AND FITNESS FOR PURPOSE, ARE
DISCLAIMED.

===================================================================================================*/

msc {
	// Display properties
	hscale = "1";
	
	// Declare entities
	 host              [label = "Host", textbgcolor = "#edebff", arctextbgcolor = "#edebff"]
	,plugin            [label = "Plug-In", textbgcolor = "#eafbef", arctextbgcolor = "#eafbef"]
	;
	
	// -------------------
	|||;
	|||;
	host note plugin [label = "Initialization", textbgcolor = "#f0f0f0"];
	// -------------------
	
	host rbox host [label = "For each parameter"];
	host => plugin [label = "AAX_IEffectParameters::GetParameterDefaultNormalizedValue()", URL = "AAX_IACFEffectParameters::GetParameterDefaultNormalizedValue()"];
	plugin >> host [label = "value"];
	
	host => plugin [label = "AAX_IEffectParameters::UpdateParameterNormalizedValue()\niSource: AAX_eUpdateSource_Unspecified", URL = "\ref AAX_IEffectParameters::UpdateParameterNormalizedValue()"];
	... [label = "(see sequence above)"];
	plugin >> host;
	
	host rbox host [label = "Following all parameter updates"];
	host => plugin [label = "AAX_IEffectParameters::GenerateCoefficients()", URL = "\ref AAX_IEffectParameters::GenerateCoefficients()"];
	... [label = "(see sequence above)"];
	plugin >> host;
	
	|||;
	... [label = "Timestamp synchronization with real-time thread"];
	|||;
	
	host rbox host [label = "PostPacket() processed"];
	host -> plugin [label = "Update algorithm context", linecolor = "gray"];
	
	
	// [label = "", URL = "\ref "];
		
}
